Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-q5k7basu44-e1siuc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-q5k7basu44-347vaj-GET-200]
module.pgxflow[0].aws_api_gateway_method_settings.PgxApi: Refreshing state... [id=whl80ga3f6-prod-*/*]
module.pgxflow[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1KGPEMHEBI6DX]
module.sbeacon.aws_api_gateway_method_response.individuals-id_post: Refreshing state... [id=agmr-q5k7basu44-82hpr9-POST-200]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-q5k7basu44-82hpr9-POST]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-q5k7basu44-5l0now-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-q5k7basu44-5l0now-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-q5k7basu44-b5s2mr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-q5k7basu44-a3h38f-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-q5k7basu44-6cnxhw-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-q5k7basu44-6cnxhw-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-q5k7basu44-b5s2mr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-q5k7basu44-93fyd7-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-q5k7basu44-kzwrfw-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-q5k7basu44-fh7fed-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-q5k7basu44-kzwrfw-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-q5k7basu44-annyyp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-q5k7basu44-a3h38f-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-q5k7basu44-8bdpcq-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-q5k7basu44-x9yetb-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-q5k7basu44-tfoc5g-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-q5k7basu44-tfoc5g-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-q5k7basu44-93fyd7-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-q5k7basu44-x9yetb-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-q5k7basu44-8bdpcq-POST-200]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-pharmcat: Read complete after 0s [id=156379826]
module.sbeacon.aws_api_gateway_integration_response.filtering_terms: Refreshing state... [id=agir-q5k7basu44-j4lxyc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-q5k7basu44-fh7fed-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-q5k7basu44-annyyp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-q5k7basu44-2ztt52-POST-200]
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp: Reading...
module.pgxflow[0].module.pipeline_lookup.data.aws_iam_policy_document.lambda-dbsnp: Read complete after 0s [id=212627211]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-pharmcat:pgxflow-backend-pharmcat-0]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-pharmcat.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-pharmcat]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-dbsnp:pgxflow-backend-dbsnp-0]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPostprocessor: Refreshing state... [id=PGxFlowBackendAllowLambdaPostprocessorInvoke]
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-preprocessor: Reading...
module.pgxflow[0].module.pipeline_pharmcat.data.aws_iam_policy_document.lambda-preprocessor: Read complete after 0s [id=1798435166]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=pgxflow-backend-preprocessor:pgxflow-backend-preprocessor-0]
module.pgxflow[0].module.pipeline_lookup.module.lambda-dbsnp.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-dbsnp]
module.pgxflow[0].module.pipeline_lookup.aws_sns_topic_subscription.dbsnp: Refreshing state... [id=arn:aws:sns:ap-southeast-3:496940679572:pgxflow-backend-dbsnp:ebcf53ba-1694-47e6-9e26-b317f35f67ab]
module.pgxflow[0].module.pipeline_lookup.aws_lambda_permission.dbsnp_invoke_permission: Refreshing state... [id=SNSDbsnpAllowInvoke]
module.pgxflow[0].module.pipeline_pharmcat.module.lambda-preprocessor.aws_lambda_function.this[0]: Refreshing state... [id=pgxflow-backend-preprocessor]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.preprocessor_invoke_permission: Refreshing state... [id=SNSPreprocessorAllowInvoke]
module.pgxflow[0].module.pipeline_pharmcat.aws_lambda_permission.LambdaPharmcat: Refreshing state... [id=PGxFlowBackendAllowLambdaPharmcatInvoke]
module.pgxflow[0].module.pipeline_pharmcat.aws_sns_topic_subscription.preprocessor: Refreshing state... [id=arn:aws:sns:ap-southeast-3:496940679572:pgxflow-backend-preprocessor:0c553e04-1f53-4324-a5ef-4cd1bfe06e49]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-q5k7basu44-2ztt52-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-q5k7basu44-82hpr9-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-q5k7basu44-8staf5-POST-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=tyo0ze]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-q5k7basu44-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=q5k7basu44-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=EV4SR0G87Q5X1]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=88c86ade-555f-4e9c-bb00-3ff36227eb89]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E2R5FL0AEVBUSP]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=2432882119]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250507095514592000000001]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Read complete after 1m19s [id=-]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.gaspifs.null_resource.gaspifs-upload will be created
  + resource "null_resource" "gaspifs-upload" {
      + id       = (known after apply)
      + triggers = {
          + "cargo_lock_hash"  = "df3d79f6946394d188a60268e5519c322e98d5ab"
          + "cargo_toml_hash"  = "07ebe065b46a160fc6ba48f308d26508e3cd9d6a"
          + "docker_file_hash" = "a20d1ec7ca803881a0e501bb2d176e636409a8c3"
          + "source_hash"      = "cf4a361237609d6aaadccf79ead79e97d4bf5608"
        }
    }

  # module.pgxflow[0].aws_lambda_layer_version.binaries_layer (deposed object 07f056cb) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "binaries_layer" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:9" -> null
      - code_sha256                 = "UPlEf1ifTlbjZtOvO+AcLsEQkiVj2UbMu9epgUodZpE=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:02.654+0000" -> null
      - filename                    = "pgxflow/binaries.zip" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer:9" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_binaries_layer" -> null
      - layer_name                  = "pgxflow_backend_binaries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - skip_destroy                = false -> null
      - source_code_hash            = "UPlEf1ifTlbjZtOvO+AcLsEQkiVj2UbMu9epgUodZpE=" -> null
      - source_code_size            = 15168129 -> null
      - version                     = "9" -> null
        # (4 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer (deposed object 32863fdb) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "binaries_layer" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:9" -> null
      - code_sha256                 = "S/HQYoHaM+SF2TiF82dzkuhDMs6mEOkapkr6R2ntYGw=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:06.790+0000" -> null
      - filename                    = "sbeacon/binaries.zip" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:9" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer" -> null
      - layer_name                  = "sbeacon_backend_binaries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - skip_destroy                = false -> null
      - source_code_hash            = "cbGF3X1+aIrSjKdnfwACjNPI/gMMcIPdysqHrEb5+C1aGfmujfQxhSnkaEQNCuLWY0mBMmtJug6dRZQTwCPZ1g==" -> null
      - source_code_size            = 18422741 -> null
      - version                     = "9" -> null
        # (4 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal20250519062439005900000006"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate will be created
  + resource "null_resource" "cloudfront-invalidate" {
      + id       = (known after apply)
      + triggers = {
          + "compiled_code_hash" = "a69defff9c7a05e4cdb1074e2604d679884af74a"
        }
    }

  # module.webgui.null_resource.s3-upload will be created
  + resource "null_resource" "s3-upload" {
      + id       = (known after apply)
      + triggers = {
          + "build_file_hash"    = "caab493802eac5ae99fb1979ad045b4f3c946757"
          + "compiled_code_hash" = "a69defff9c7a05e4cdb1074e2604d679884af74a"
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate will be created
  + resource "terraform_data" "cloudfront-version-invalidate" {
      + id               = (known after apply)
      + triggers_replace = [
          + "",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-customMessageLambdaTrigger"
      ~ last_modified                  = "2025-08-27T08:24:05.929+0000" -> (known after apply)
      ~ source_code_hash               = "Zsn2RD2TApmmdyhdDJh87hz7yapLpw7xMPGXf/dujEk=" -> "aSHSVnYqHku1LG9kp+Car7LE4JTuoVIKU9OInfrS4Tc="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] (deposed object 64f29155) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1869639089258103147" -> null
      - triggers = {
          - "filename"  = "builds/2a66512866b4ba2207cf913d887b0861be7503e766dae546cfba8cf56e62fdc3.zip"
          - "timestamp" = "1756361685240473000"
        } -> null
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-logEmailDelivery"
      ~ last_modified                  = "2025-08-27T08:24:04.903+0000" -> (known after apply)
      ~ source_code_hash               = "tSHtN7Oi326M84JFNBjP8U2C2pU3uSsLEHIHpL+N7LY=" -> "atgJ7XCPXgwQH4PeG3KN2eZXu0jq4JPuYEz6O8yKHkI="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendClinicJobEmail"
      ~ last_modified                  = "2025-08-27T08:24:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "Nzt6NqrAd8/u+8Cfkd+WkvWiS+S0AvcWNjjgOdQi/7w=" -> "ckYKGARpE20K3LbRPcxPnO4vl/orCmuTaT9mLX16raw="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] (deposed object cfbfbb0b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "1337235770744722143" -> null
      - triggers = {
          - "filename"  = "builds/8225510b62bf60b687b5614da58232658f9caa7053aed32e35c914e3cf72c09e.zip"
          - "timestamp" = "1756361685449994000"
        } -> null
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendRegistrationEmail"
      ~ last_modified                  = "2025-08-27T08:24:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "hAEkyAtEiWHFmJAS2s1yFFH4JxaQAh7Y2HnY+01t5RI=" -> "lYPBCLPJZ1HRU9S1yv1H0//2HTwoAZeWW0OQ62fCrpE="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] (deposed object 0617627c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2260548409954944835" -> null
      - triggers = {
          - "filename"  = "builds/0ab4695261445c275b666691d159b2827f1a283a9dbdb793347795a9ed72494d.zip"
          - "timestamp" = "1756361684846930000"
        } -> null
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "error-catcher-notifyOnError"
      ~ last_modified                  = "2025-08-27T08:24:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "jWSIBhLswOwZfj08abtWHrOznE9UivxhAQuA7Oq1Ddk=" -> "eJxDeWBJnwr4lDNUDS923hFX1cwIWOWqc/EhB/YXKSc="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "error-catcher"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "47c35ad41bcf019107c1d447054181bb7973376b"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:046d74c6c82549522e2d42856e0259d5962997c311640f1e01039f79ae648ac6" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers"
      ~ sha256_digest        = "sha256:046d74c6c82549522e2d42856e0259d5962997c311640f1e01039f79ae648ac6" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "05b51da2745a3b8a7ccd7bff037a507afec312dc" -> "47c35ad41bcf019107c1d447054181bb7973376b"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchStarter"
      ~ last_modified                  = "2025-09-24T03:25:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "zhVWNlPGwmwNWd3Y/rjle9CIQxe9Li1YyhLbLXkCCVI=" -> "lnOYGfMYFseS7WbkYwqiaHWMCFgf0D2g0RVpbgV9E8M="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-batchSubmit"
      ~ last_modified                  = "2025-09-24T03:25:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "ybHqx46M+ww4qxcZ3i0bO3ni/y2w8axPcBT4uVMhDqY=" -> "eS60iePwyTrutanrQSjZaKw9RcAEbwrgxpxNZNH0Yeo="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-batchSubmit.null_resource.archive[0] (deposed object d5480857) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5664222191838405854" -> null
      - triggers = {
          - "filename"  = "builds/4210711773ed925dad12fb420efb6a5ef9a7debed13d0e2751af6c37c3a1638d.zip"
          - "timestamp" = "1756361700666369000"
        } -> null
    }

  # module.pgxflow[0].module.lambda-getResultsURL.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-getResultsURL"
      ~ last_modified                  = "2025-09-24T03:25:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "mT/FNPwiBFzG2Cvk0V7ZSzMseZ8Nv2J7NSBUjmxfxkk=" -> "Wnn00d1VwqyBPHV/TY4aMcsuKMuc74xvsYjkT7zxVcI="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-getResultsURL.null_resource.archive[0] (deposed object 98059a6b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5353161973208422263" -> null
      - triggers = {
          - "filename"  = "builds/b13c4a78bd55bc20d4dc8147578c931acb0b836487b00cbfec051c64a7693bf8.zip"
          - "timestamp" = "1756361700748755000"
        } -> null
    }

  # module.pgxflow[0].module.lambda-initFlow.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-initFlow"
      ~ last_modified                  = "2025-09-24T03:25:37.000+0000" -> (known after apply)
      ~ source_code_hash               = "t0Itrw3MKwIP+6BIgiEvzOvDkygn/+Y1vuxPBS1c8D4=" -> "UrKgMcjSz7DZ4w9Bd58L2CYixuk8CEI88mYosEULRHc="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-initFlow.null_resource.archive[0] (deposed object 43c8627c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4236660406947051515" -> null
      - triggers = {
          - "filename"  = "builds/08e9ac66aa91b1fa215c5f717ba16651bdffb481e2e36bdfac525a6b1f984e99.zip"
          - "timestamp" = "1756361700912474000"
        } -> null
    }

  # module.pgxflow[0].module.lambda-qcFigures.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcFigures"
      ~ image_uri                      = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/pgxflow-qcfigures-lambda-containers@sha256:046d74c6c82549522e2d42856e0259d5962997c311640f1e01039f79ae648ac6" -> (known after apply)
      ~ last_modified                  = "2025-08-28T06:18:05.000+0000" -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-qcNotes"
      ~ last_modified                  = "2025-09-24T03:25:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "7PhXZl+AByb8RSh9io1OvbBmQC0I1kC2hGyFvp+EWhw=" -> "3N1Gyrt0R22rouazQTFHj3X2Sk0NdruGPxAyxQcLupA="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-qcNotes.null_resource.archive[0] (deposed object 1fd6a44e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3286309420736970208" -> null
      - triggers = {
          - "filename"  = "builds/5fcae5daff2ded5d6ba61b1a0dc3b0d861470d10c1d6f29710fd8a344e6ba81c.zip"
          - "timestamp" = "1756361700584431000"
        } -> null
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "pgxflow-backend-sendJobEmail"
      ~ last_modified                  = "2025-09-24T03:25:31.000+0000" -> (known after apply)
      ~ source_code_hash               = "dIxkqUuyIWo6uh2DIglMIqtW0iHcLpWypXq9noqqExw=" -> "fhJcpuOnK9rBLufMKlaiGCtDa2DC2DAV6GyrtsJ9TWY="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "pgxflow-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.pgxflow[0].module.lambda-sendJobEmail.null_resource.archive[0] (deposed object 9b4ca7e8) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7198756868642591030" -> null
      - triggers = {
          - "filename"  = "builds/2d26d62301ee609c22b9ce864adea839b0695531c99b94868036112b261aeb3a.zip"
          - "timestamp" = "1756361700831021000"
        } -> null
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_lambda_layer_version.this[0] (deposed object 42fa75f9) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:8" -> null
      - code_sha256                 = "hGFoK/sZkISwlelpr0SoAWyd14aAYhNgEmnYwLEZYAI=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:05.687+0000" -> null
      - description                 = "python libraries" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer:8" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_libraries_layer" -> null
      - layer_name                  = "pgxflow_backend_python_libraries_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "pgxflow-backend-layers-20250804065614849900000001" -> null
      - s3_key                      = "builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 172659 -> null
      - version                     = "8" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.aws_s3_object.lambda_package[0] (deposed object f4806ee6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250804065614849900000001/builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip" -> null
      - bucket                        = "pgxflow-backend-layers-20250804065614849900000001" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "315870bfba17e17aaa1d67dba2a71df5" -> null
      - force_destroy                 = false -> null
      - id                            = "pgxflow-backend-layers-20250804065614849900000001/builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip" -> null
      - key                           = "builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_libraries_layer.null_resource.archive[0] (deposed object dea6b6c2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7298861572116236696" -> null
      - triggers = {
          - "filename"  = "builds/4c32f16ef2f2f49c822fd021fd5517a0f5b1452b39ad25c9d243df0b59938a30.zip"
          - "timestamp" = "1756361703728175000"
        } -> null
    }

  # module.pgxflow[0].module.python_modules_layer.aws_lambda_layer_version.this[0] (deposed object beee8480) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_lambda_layer_version" "this" {
      - arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:13" -> null
      - code_sha256                 = "Zlw8g0TL4Qd9IVwI/zyKASLJAJprg6Og3O3xPKjxZDo=" -> null
      - compatible_architectures    = [] -> null
      - compatible_runtimes         = [
          - "python3.12",
        ] -> null
      - created_date                = "2025-08-28T06:18:07.675+0000" -> null
      - description                 = "python modules" -> null
      - id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer:13" -> null
      - layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:pgxflow_backend_python_modules_layer" -> null
      - layer_name                  = "pgxflow_backend_python_modules_layer" -> null
      - region                      = "ap-southeast-3" -> null
      - s3_bucket                   = "pgxflow-backend-layers-20250804065614849900000001" -> null
      - s3_key                      = "builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip" -> null
      - skip_destroy                = false -> null
      - source_code_size            = 22801 -> null
      - version                     = "13" -> null
        # (5 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.aws_s3_object.lambda_package[0] (deposed object 399539c2) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "aws_s3_object" "lambda_package" {
      - acl                           = "private" -> null
      - arn                           = "arn:aws:s3:::pgxflow-backend-layers-20250804065614849900000001/builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip" -> null
      - bucket                        = "pgxflow-backend-layers-20250804065614849900000001" -> null
      - bucket_key_enabled            = false -> null
      - content_type                  = "application/octet-stream" -> null
      - etag                          = "4c7e06f92c1d424a6c9defc572c613c0" -> null
      - force_destroy                 = false -> null
      - id                            = "pgxflow-backend-layers-20250804065614849900000001/builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip" -> null
      - key                           = "builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip" -> null
      - metadata                      = {} -> null
      - region                        = "ap-southeast-3" -> null
      - server_side_encryption        = "AES256" -> null
      - source                        = "builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip" -> null
      - storage_class                 = "ONEZONE_IA" -> null
      - tags                          = {} -> null
      - tags_all                      = {} -> null
        # (14 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.python_modules_layer.null_resource.archive[0] (deposed object 5ffc3743) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5573612915150012264" -> null
      - triggers = {
          - "filename"  = "builds/6758b31724274778eda9819040d8b626ef48fc3f298ca56b44d1027cf0f9e085.zip"
          - "timestamp" = "1756361701167171000"
        } -> null
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "4fed4f70a6dd18323948c4ed0a96e3818e54dcd3"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:7217c803912e942e765934a6de423704763e6758be461638c9517b57b099a072" -> (known after apply)
        name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:7217c803912e942e765934a6de423704763e6758be461638c9517b57b099a072" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "a817a7e4c2e8a63e82e93d02493fbf973f85fc93" -> "4fed4f70a6dd18323948c4ed0a96e3818e54dcd3"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/e512dd16edc68920cc6daac38137f79e349e1367e65e9bf380b1c5b4b6f32299.zip" -> "builds/d861b638c81e86468e3f0dbc3ce97d987f334af42da43ca82324ecc371fbbbdf.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-08-28T06:18:25.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "0HfMeeRQ6LbX5I8Sy8m4o7UID1liSYhxx6M0jHgEMMk="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] (deposed object 56f93d0e) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "703595700007032358" -> null
      - triggers = {
          - "filename"  = "builds/e512dd16edc68920cc6daac38137f79e349e1367e65e9bf380b1c5b4b6f32299.zip"
          - "timestamp" = "1756361685339948800"
        } -> null
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                            # (9 unchanged elements hidden)
                            "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
                          + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-cli-upload",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "pricing:*"
                        Effect   = "Allow"
                        Resource = "*"
                    },
                  ~ {
                      ~ Resource = [
                            # (1 unchanged element hidden)
                            "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                          + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-cli-upload/index/cli-uploads-project-name-index",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = "cognito-idp:ListUsers"
                        Effect   = "Allow"
                        Resource = "arn:aws:cognito-idp:ap-southeast-3:496940679572:userpool/ap-southeast-3_Ta5TVYZ4S"
                    },
                    # (3 unchanged elements hidden)
                    {
                        Action    = "s3:ListBucket"
                        Condition = {
                            StringLike = {
                                "s3:prefix" = [
                                    "projects/*",
                                    "private/*",
                                ]
                            }
                        }
                        Effect    = "Allow"
                        Resource  = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                    },
                  ~ {
                      ~ Action   = [
                          + "s3:PutObject",
                            "s3:GetObject",
                            # (1 unchanged element hidden)
                        ]
                      ~ Resource = [
                            "arn:aws:s3:::gaspi-metadata20250519061956402900000002/*",
                          ~ "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*" -> "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/*",
                        ]
                        # (1 unchanged attribute hidden)
                    },
                    {
                        Action   = "s3:DeleteObject"
                        Effect   = "Allow"
                        Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/private/*"
                    },
                    # (3 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/bcea1c27fc757fe336baa8041c5aaa06890e646261ca6a8ac7edec780397b3d9.zip" -> "builds/8b995715bed619127af225162fa41c6ab590d7106660b2cd1433090d69e57e4e.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-08-28T06:18:43.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "Ucaa2ADl0nXQFFTTaKYkPr/fbu11MsmGJFMkfeDey28="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_CLI_UPLOAD_TABLE"              = "sbeacon-dataportal-cli-upload"
                # (53 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] (deposed object bc96dc5b) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8834388157378025420" -> null
      - triggers = {
          - "filename"  = "builds/bcea1c27fc757fe336baa8041c5aaa06890e646261ca6a8ac7edec780397b3d9.zip"
          - "timestamp" = "1756361685545796000"
        } -> null
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-deidentifyFiles"
      ~ last_modified                  = "2025-08-28T06:18:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "v9qpnng/UF62UO2I4UygjtO7VqC2NfrMho0tn+279EU=" -> "DeqIMiE7NRpgA+TKixdR1ewgUoR+E8nTfO4jKqzBR1k="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-deidentifyFiles.null_resource.archive[0] (deposed object 32569a9f) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4425049757737287381" -> null
      - triggers = {
          - "filename"  = "builds/5a6513a124539d405e198f8b667d222b031442e312b7167506d63dc12fb79547.zip"
          - "timestamp" = "1756361684644892000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateCohortVCfs"
      ~ last_modified                  = "2025-08-28T06:18:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:9",
        ] -> (known after apply)
      ~ source_code_hash               = "x9EtMNZW9qUoHcaH8RWLnvm7f79m2B4PF1+XI6++TQk=" -> "1WR2U3hSBetWluyrnLXcisT4DBgWPwLCWALziyy5Xas="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateCohortVCfs.null_resource.archive[0] (deposed object ffc3d007) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "8679099795194237193" -> null
      - triggers = {
          - "filename"  = "builds/2fed43367c56d0422d0098b15003d4ff9ae27cf689d7cfee7a7a5289345d6cc6.zip"
          - "timestamp" = "1756361686325505000"
        } -> null
    }

  # module.sbeacon.module.lambda-generateReports.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-generateReports"
      ~ last_modified                  = "2025-09-24T03:25:30.000+0000" -> (known after apply)
      ~ source_code_hash               = "AKCgwen9JHFcQdS5BgftjS7kZqZOSxa6IGWNFy8Xbsc=" -> "WujkSArGrl+MOY+HmcNbZBnAz1nZg6TIY+RFRH2NG7M="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (28 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-generateReports.null_resource.archive[0] (deposed object d69b086c) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2562498899717370028" -> null
      - triggers = {
          - "filename"  = "builds/0300e75b7f536502cf4a1de5308dcfa7fc3b7756791a2ad0c7579e34a8fcf036.zip"
          - "timestamp" = "1756361684633147000"
        } -> null
    }

  # module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getAnalyses"
      ~ last_modified                  = "2025-08-28T06:18:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "8z23jLRgMT7tulasCJppMOgnhp5faTw4R4bwVkP+uaM="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getAnalyses.null_resource.archive[0] (deposed object 5842cdc8) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4411304211523771186" -> null
      - triggers = {
          - "filename"  = "builds/a7bd83ed0d8a536495679c588b7db329d03eb49388aab75337bf8432251682e3.zip"
          - "timestamp" = "1756361685476478000"
        } -> null
    }

  # module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getBiosamples"
      ~ last_modified                  = "2025-08-28T06:18:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "G5wRjLCCmeVVPfhssbc5xbDjTefyv+wbnuFgiFvNmjs="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getBiosamples.null_resource.archive[0] (deposed object 95e747c7) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3854390604748897433" -> null
      - triggers = {
          - "filename"  = "builds/45d2eecf1b7259072f636aa61cf33b646d8982a40e93a0231fa59ad8592f3066.zip"
          - "timestamp" = "1756361686461677000"
        } -> null
    }

  # module.sbeacon.module.lambda-getConfiguration.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getConfiguration"
      ~ last_modified                  = "2025-08-28T06:18:23.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "QOwuKfescA3TDAtugbIBF0XsDZq5JdU5D9U+n4RHlkw="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getConfiguration.null_resource.archive[0] (deposed object 306bc8fb) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4489911272184360146" -> null
      - triggers = {
          - "filename"  = "builds/bdfd549747da6fdfb5247f317d63fae8452b23a25d28d2bec5c967ba3341d016.zip"
          - "timestamp" = "1756361685146590000"
        } -> null
    }

  # module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/8889d98b332ff2c345abce7901cc08df06679e2d8832131525ac9cd4b3a37923.zip" -> "builds/f78997bb9bc0dea380d8498a4b2d3a671780471d2abe725a7a99d2839c679c9f.zip"
        id                             = "sbeacon-backend-getDatasets"
      ~ last_modified                  = "2025-08-28T06:18:36.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "SUhAfjHp6/6KBZGv/ey64ln/UPPiND/y3vNq0qmQS4I="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (26 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getDatasets.null_resource.archive[0] (deposed object 823f1c84) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "3709252823014795725" -> null
      - triggers = {
          - "filename"  = "builds/8889d98b332ff2c345abce7901cc08df06679e2d8832131525ac9cd4b3a37923.zip"
          - "timestamp" = "1756361685322164000"
        } -> null
    }

  # module.sbeacon.module.lambda-getEntryTypes.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getEntryTypes"
      ~ last_modified                  = "2025-08-28T06:18:23.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "z/QhpGllxNHrnC0mOQaezNhCdfANnlshVEgZv9uU4gM="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getEntryTypes.null_resource.archive[0] (deposed object 0ab9b7a3) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "5435797285187752400" -> null
      - triggers = {
          - "filename"  = "builds/238c996d7bde89f739f1e7095110c69c47ce7589b588b35ea1f94beaf9b14210.zip"
          - "timestamp" = "1756361684784588000"
        } -> null
    }

  # module.sbeacon.module.lambda-getFilteringTerms.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getFilteringTerms"
      ~ last_modified                  = "2025-08-28T06:18:19.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "oN2EkjXHXq2RnMlRr5rLa/fmfGBrfs3+ZExRNoQkzH4="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getFilteringTerms.null_resource.archive[0] (deposed object c59aefc6) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "7921723634507485134" -> null
      - triggers = {
          - "filename"  = "builds/454b6d5e06b61167a7515cba40e977ff31c8f2db728e6c419afec860c13d5c85.zip"
          - "timestamp" = "1756361686348923000"
        } -> null
    }

  # module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getGenomicVariants"
      ~ last_modified                  = "2025-08-28T06:18:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "Ft+wNARiQ+Ipdw+rbB9i+3WmBhyIFbhmY0k44JsA7I4="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getGenomicVariants.null_resource.archive[0] (deposed object ae17ff21) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "2599792936418979390" -> null
      - triggers = {
          - "filename"  = "builds/03cd2c3a98ebceb946ba1918b071fc2ed8a8e44431aa9ceb30659f6b1a23bb97.zip"
          - "timestamp" = "1756361686244651000"
        } -> null
    }

  # module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getIndividuals"
      ~ last_modified                  = "2025-08-28T06:18:30.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "G94XQaS8Ou2a/68nnU9XY2lWHVzB5uTduWHtJO2MrgY="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getIndividuals.null_resource.archive[0] (deposed object 78e8c812) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "4365572537370490299" -> null
      - triggers = {
          - "filename"  = "builds/54d135633142b071ec455b6045d8f1cbc9c559b03c00a6311b967298b458ab40.zip"
          - "timestamp" = "1756361685152890000"
        } -> null
    }

  # module.sbeacon.module.lambda-getInfo.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getInfo"
      ~ last_modified                  = "2025-08-28T06:18:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "gmW4Ae9eP1xSHnd9oZuTBux2erclJy96jvPFMoa62aY="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getInfo.null_resource.archive[0] (deposed object 6b45aa02) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6519887017874188612" -> null
      - triggers = {
          - "filename"  = "builds/549ea2149ce3f8600d7817b5ad724fa92298664f34913190d9d5c78566719e70.zip"
          - "timestamp" = "1756361686438827000"
        } -> null
    }

  # module.sbeacon.module.lambda-getMap.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getMap"
      ~ last_modified                  = "2025-08-28T06:18:18.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      + source_code_hash               = "49t2vFtnq5gERZx4I6FT2XJUGqResXOqI0KKxwEaoDs="
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-getMap.null_resource.archive[0] (deposed object a6637518) will be destroyed
  # (left over from a partially-failed replacement of this instance)
  - resource "null_resource" "archive" {
      - id       = "6970988915221700121" -> null
      - triggers = {
          - "filename"  = "builds/6e74e5347aeb09443a9bcfb7a1b7f282d19c03509066e7bd1bfa6ff3d1787540.zip"
          - "timestamp" = "1756361686055661000"
        } -> null
    }

  # module.sbeacon.module.lambda-getProjects.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "sbeacon-backend-getProjects"
      ~ last_modified                  = "2025-08-28T06:18:23.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_libraries_layer:10",
          - "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_python_modules_layer:11",
        ] -> (known after apply)
      ~ source_code_hash               = "QfT8o6HDzHmM8/q5XZ6aKCxfdWy3t4Ki+KFXH9BDrWE=" -> "eMRv+l/CQ/sVRrSyCWpNPtMu
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.